tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "khanhas/tap"
brew "gotop"
brew "libtool"
brew "imagemagick"
brew "neofetch"
brew "node"
brew "pfetch"
brew "pipes-sh"
brew "python"
brew "ruby"
brew "thefuck"
brew "youtube-dl"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "khanhas/tap/spicetify-cli"
cask "appcleaner"
cask "blackhole"
cask "chromium"
cask "figma"
cask "firefox"
cask "flux"
cask "github"
cask "iina"
cask "iterm2"
cask "keka"
cask "nisus-thesaurus"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
